Revit 2027 API
CameraInfo.IsPerspective Property
 Identifies whether the projection is orthographic or perspective
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPerspective { get; }
Public ReadOnly Property IsPerspective As Boolean
	Get
public:
property bool IsPerspective {
	bool get ();
}
member IsPerspective : bool with get
Property Value
Boolean
See Also
Reference
CameraInfo Class
Autodesk.Revit.DB Namespace